<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<meta name="viewport"
	content="width=device-width, initial-scale=1, shrink-to-fit=no">

<!-- Bootstrap CSS -->
<link rel="stylesheet"
	href="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css"
	integrity="sha384-Vkoo8x4CGsO3+Hhxv8T/Q5PaXtkKtu6ug5TOeNV6gBiFeWPGFN9MuhOf23Q9Ifjh"
	crossorigin="anonymous">

<link rel="stylesheet" href="../resources/css/common.css">

<title>회원가입 약관</title>

<style>
#agree-textarea{
	resize: none;
    width: 100%;
    height: 600px;
    margin: 20px 0px 20px 0px;
}
</style>
</head>
<body>
	<jsp:include page="../common/header.jsp" />
	<jsp:include page="../common/nav.jsp" />

	<div class="container my-5">
        <h1 style="text-align: center;">회원가입 약관</h1>
        <textarea id="agree-textarea" readonly>
    제 1 장 총칙 

    제 1 조 (목 적)
    이 약관은 국내 여행계획 전문 사이트 Outrip( 이하 "회사"라 합니다.)이 제공하는 정보서비스( 이하 "서비스"라 한다)의 이용조건 및 절차에 관한 사항을 규정함을 목적으로 합니다.

    제 2 조 (약관의 효력 및 변경)
    ① 이 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로 회원에게 공지함으로써 효력이 발생합니다.
    ② 회사는 합리적인 사유가 발생될 경우에는 이 약관을 변경할 수 있으며, 약관이 변경된 경우에는 최소한 7일전에 ①항과 같은 방법으로 공시합니다.

    제 3 조 (약관 외 준칙)
    이 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법및
    기타 관련법령의 규정에 따릅니다.

    제 4 조(용어의 정의)
        이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

    ① 회원.회원사 : 회사와 서비스 이용계약을 체결한 개인이나 법인 또는 법인에 준하는 단체.
    ② 운영자 : 서비스의 전반적인 관리와 원활한 운영을 위하여 회사가 선정한 사람.
    ③ 아이디(ID): 회원식별과 회원의 서비스 이용을 위하여 회원 가입 시 사용하는 문자와 숫자의 조합.
    ④ 비밀번호 : 회원(회원사)의 비밀 보호를 위해 회원 자신이 설정한 문자와 숫자의 조합.
    ⑤ 서비스중지: 정상이용 중 회사가 정한 일정한 요건에 따라 일정기간동안 서비스의 제공을 중지하는것.
    ⑥ 해지 : 회사 또는 회원이 서비스 개통 후 이용계약을 해약하는 것.
    ⑦ 빅장 회원 : 회원(이하 "회원사"라 칭함)이 한달에 일정금액을 내고 서비스를 이용하는 개인이나 단체.
    ⑨ 전사독 회원 : 무료 서비스를 이용하는 개인이나 단체.

    제 2장 이용계약 체결

    제 5 조 ( 서비스의 구분)
    ① 회사가 회원에게 제공하는 서비스는 무료서비스와 유료서비스 등으로 구분합니다.
    ② 서비스의 종류와 내용 등은 회사가 공지나 서비스 이용안내에서 별도로 정하는 바에 의합니다.

    제 6 조( 이용계약의 성립)
    ① 아래 " 위의 이용약관에 동의하십니까? " 라는 물음에 회원(회원사)이 "동의" 버튼을 누르면 이 약관에 동의하는 것으로 간주됩니다.
    ② 이용계약은 회원(회원사)이 이용신청에 대하여 회사가 승낙함으로써 성립합니다. 회사는 신청일 24시간 이내에 이용 승낙의 의사를 이용 신청 시 기재한 e-mail을 통하여 이용 신청자에게 통지합니다.

    제 7 조( 이용 신청 및 승낙)
    ① 이용신청은 서비스의 이용자등록에서 다음사항을 가입신청 양식에 기록하여 신청합니다. 
        
    ⓐ 이름
    ⓑ e-mail
    ⓒ 아이디,비밀번호
    ⓓ 주민등록번호
    ⓔ 주소
    ⓕ 전화번호 
    ⓖ 회원등급
    ⓗ 개인.회원사
    ⓘ 빅장 구사 여부

    ② 이용계약은 회원의 이용자등록에 대하여 회사의 이용승낙으로 성립한다.
    ③ 회사는 다음과 같은 사유가 발생한 경우 이용신청에 대한 승낙을 거부합니다.

    ⓐ불건전한 음란물이나 불법거래, 대한민국 법률에 위반되는 내용을 기재한자.
    ⓑ기타 위법한 이용신청임이 확인된 경우

    제 8 조( 이용계약 사항의 변경) 
    ① 회원은 이용 신청시 기재한 사항이 변경되었을 경우에는 운영자에게 수정요청을 해야 합니다.

    제 9 조( 이용계약의 종료 )
    ① 이용계약은 회원 또는 회사의 해지에 의하여 즉시 뼈와 살이 분리됩니다.
    ② 회원은 해지의사 발생 시 즉시 회사에 e-mail을 통한 해지 신청을 합니다.
    ③ 회사는 다음과 같은 사유 발생시 이용신청에 대한 빅장을 구사 할 수 있습니다.

    ⓐ 불건한 내용을 유포하거나 회사에 중대한 손해를 끼친 개인이나 회원사.
    ⓑ 테마 쇼핑에 불건전한 내용을 담고 있거나 불법거래 등을 위한 목적으로 운영될 경우
    ⓒ 기타 회사의 합리적인 판단에 의하여 회원<회원사>으로 부적합하다고 판단될 경우

    제 3 장 서비스 이용

    제 10 조 (서비스의 이용 개시)
    ① 회사는 회원의 이용신청을 승낙한 때부터 즉시 서비스를 개시합니다.
    ② 회사의 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는 경우에는 서비스에 공지하거나 회원에게 즉시 이를 통지합니다.

    제 11 장 ( 서비스의 내용 )
    회사가 제공하는 서비스는 다음과 같습니다.   

    회사가 제공하는 각종 부가서비스를 이용할 수 있으며 상세한 부가서비스의 내용은 서비스 화면에 제공됩니다.
        
    제 12 장 (서비스의 요금 및 이용시간)

    ⓐ 서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 회사가 업무상이나 기술상의 이유로 서비스가 일지중지 되거나, 운영상의 목적으로 회사가 정한 기간에는 서비스가 일시 중지 될 수 있습니다. 이러한 경우 회사는 사전 또는 사후 이를 공지합니다.   
    ⓑ 회사는 서비스를 일정범위로 분할하여 각 범위별로 이용가능한 시간을 별도로 정할 수 있으며 이 경우 그 내용을 사전에 공지합니다.

    제 13 조 (정보의 제공 및 광고의 게재)
    ① 회사는 서비스의 운용과 관련하여 서비스 화면, 홈페이지, 이메일 등에 광고 등을 게재할수 있습니다.
    ② 회사는 서비스를 운용함에 있어서 각종 정보를 서비스에 게재하는 방법 등으로 회원에게 제공할 수 있습니다.

    제 14조 (게시물 또는 내용물의 삭제)
    회사는 서비스의 게시물 또는 내용물이  규정에 위반되거나 게시기간을 초과하는 경우 사전 통지나 동의 없이 이를 삭제할 수 있습니다.

    제 15 조 ( 서비스 제공의 중지)
    회사는 언제든지, 그리고 수시로 본 서비스(혹은 그 일부)를, 통지하거나 또는 통지함이 없이, 일시 또는 영구적으로 수정하거나 중단할 수 있습니다. 귀하는 서비스의 수정, 중단 또는 중지에 대해 회사가 귀하 또는 제 3자에 대하여 어떠한 책임도 지지 않음에 동의합니다. 

    제 4 장 권리와 의무

    제 16 조 ( 회사의 의무)
    ① 회사는 특별한 사유가 없는 한 서비스 제공설비를 항상 운용 가능한 상태로 유지보수하여야하며, 안정적으로 서비스를 제공할 수 있도록 최선의 노력을 다하여야 합니다.
    ② 관계 법령에 의하여 수사상의  목적으로 관계기관으로부터 요구받은 경우, 정보통신 윤리위원회의 요청이 있는 경우, 기타 관계법령에 의한 경우 회사는 개인정보를 제공할 수 있습니다.
    ③ 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 즉시 처리하여야 하며, 즉시 처리가 곤란한 경우 그 사유와 처리일정을 서비스 또는 전자우편을 통하여 동 회원에게 통지하여야 합니다.

    제 17 조 회원의 의무

    ① 회원은 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 아니됩니다.
    ② 회원은 회사의 사전 동의없이 서비스를 이용하여 어떠한 영리행위도 할 수 없으며, 법에 저촉되는 자료를 배포 또는 게재할 수 없습니다.
    ③ 회원은 자신의 아이디와  비밀번호를 유지 관리할 책임이 있으며 자신의 아이디와 비밀번호를 사용하여 발생하는 모든 결과에 대해 전적인 책임이 있습니다. 또한 자신의 아이디와 비밀번호가 자신의 승낙없이 사용되었을 경우 즉시 회사에  신고하여야 합니다.
    ④ 회원은 이용신청시의 기재내용에 대해 진실하고 정확하며 현재의 사실과 일치하도록 유지하고 갱신하여야 합니다. 
    ⑤ 회원은 서비스를 이용하여 얻은 정보를 회사의 사전 승낙없이 복사, 복제, 변경, 번역, 출판, 방송 기타의 방법으로 사용하거나 이를 타인에게 제공할 수 없습니다.
    ⑥ 회원은 음란물 게재, 유포등 사회질서를 해치는 행위를 할 수 없습니다.
    ⑦ 회원은 타인의 명예를 훼손하거나 모욕하는 행위와 타인의 지적재산권 등의 권리를 침해하는 행위를 할 수 없습니다.
    ⑧ 회원은 해킹 또는 컴퓨터 바이러스를 유포하는 일, 타인의 의사에 반하여 광고성 정보등 일정한 내용을 지속적으로 전송하는 행위를 할 수 없습니다.
    ⑨ 회원은 서비스의 운영에 지장을 주거나 줄 우려가 있는 일체의 행위, 기타 관계 법령에 위배되는 일을 할 수 없습니다. 

    제 18 조 (양도 금지)
    회원은 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도, 증여할 수 없으며, 게시물에 대한 저작권을 포함한 모든 권리 및 책임은 이를 게시한 회원에게 있습니다.
        
    제 19 조 ( 계약해지 및 이용제한)
    ① 회사는 회원이 약관의 내용을 위반하고, 회사 소정의 기간 이내에 이를 해소하지 아니하는 경우 서비스 이용계약을 해지할 수 있습니다.
    ② 회사는 제 ①항에 의해 해지된 회원이 다시 이용신청을 하는 경우 일정기간 그 승낙을 제한할 수 있습니다. 
    ③ 회원이 이용계약을 해지하고자 하는 때에는 회원 본인이 서비스 또는 전자우편를 통하여 해지신청을 하여야 합니다.

    제 20 조 (손해배상)
    회사가 제공되는 서비스와 관련하여 회원에게 어떠한 손해가 발생하더라도 회사의 중대한 과실에 의한 경우를 제외하고 이에 대하여 책임을 부담하지 아니합니다. 단, 손해배상의 범위는 별도로 회사의 규정에 따릅니다.

    제 21 조 (면책 조항)
    ① 회사는 회원이 서비스에 게재한 정보, 자료, 사실의 정확성, 신뢰성등  내용에 관하여는 어떠한 책임도  부담하지 아니하고 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해등에 대해서는 책임이 면제됩니다.
    ② 회사는 회원이 서비스를 이용하여 기대하는 손익이나 서비스를 통하여 얻은 자료로 인한  손해에 관하여 책임이 면제됩니다.
    ③ 회사는 회원 상호간 또는 회원과 제 3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다.
    ④ 회사는 회원의 귀책사유로 인하여 서비스 이용의 장애가 발생한 경우에는 책임이 면제 됩니다.
    ⑤ 회사는 제휴사가 제공하는 부가서비스의 품질 및 장애에 대한 책임은 면제 됩니다.
    ⑤ 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 이 약관을 위반한 회원은 회사에 발생하는 모든 손해를  배상하여야 하며, 동 손해로부터 회사를 면책시켜야  합니다.

    제 22 조 ( 분쟁의 해결 )
    ①  회사와 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 합니다.
    ②  모든 노력에도 불구하고 소송이 제기될 경우, 소송은 회사가 관할하는 법원의 관할로 합니다.

    부칙
    제 1 조 ( 시행일)
    이 약관은 2008년 3월 1일부터 시행합니다.
            </textarea>
        <div id="agree-wrapper">
            <input type="checkbox" id="termsAgree" name="termsAgree" class="ot-termsAgree">
            <label for="termsAgree" class="ot-termsAgreeLabel">약관 동의</label>
        </div>
        <div id="btn-wrapper" class="mt-3">
        	<form action="signUpForm" method="POST" onsubmit="return signUpForm();">
        		<input id="isAgree" type="hidden" value="0" name="isAgree">
	            <a href="#" class="btn gray-btn">이전 화면</a>
	            <button class="btn main-btn float-right">가입하기</button>
        	</form>
        </div>
    </div>
	
	<jsp:include page="../common/footer.jsp" />

	<script src="https://code.jquery.com/jquery-3.4.1.min.js"
		integrity="sha256-CSXorXvZcTkaix6Yvo6HppcZGetbYMGWSFlBw8HfCJo="
		crossorigin="anonymous"></script>
	<script
		src="https://cdn.jsdelivr.net/npm/popper.js@1.16.0/dist/umd/popper.min.js"
		integrity="sha384-Q6E9RHvbIyZFJoft+2mJbHaEWldlvI9IOYy5n3zV9zzTtmI3UksdQRVvoxMfooAo"
		crossorigin="anonymous"></script>
	<script
		src="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/js/bootstrap.min.js"
		integrity="sha384-wfSDF2E50Y2D1uUdj0O3uMBJnjuUD4Ih7YwaYd1iqfktj0Uod8GCExl3Og8ifwB6"
		crossorigin="anonymous"></script>
		
    <script>
       // 가입하기
       function signUpForm() {
           if($("#termsAgree").prop("checked")){
               $("#isAgree").val("1");
               return true;
           }else{
        	   console.log("false");
               alert("약관에 동의하여 주십시오");
               return false;
           }
       }
    </script>

</body>
</html>